## Python basic functions

#### Question 1: Count all letters, digits, and special symbols from a given string
      str1 = "I@#ma26rt^&ic5us"

In [89]:
str1= "I@#ma26rt^&ic5us"
letters=0
digits=0
special_symbol=0

for x in str1:
    if x.isdigit():
        digits+=1
    elif x.isalpha():
        letters+=1
    else:
        special_symbol+=1
        
print('letters = ',letters)
print('digits = ',digits)
print('special_symbol =',special_symbol)

letters =  9
digits =  3
special_symbol = 4

#### Question 2: Write a Python program to find numbers divisible by nineteen or thirteen from a list of numbers using Lambda.¶
     a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]

In [90]:
 a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]
    
divisbleBy_19_or_13 = list(filter(lambda x: x%19==0 or x%13==0 ,a))
print('Numbers divible by 19 and 13 are = ',divisbleBy_19_or_13)

Numbers divible by 19 and 13 are =  [19, 65, 57, 39, 152, 190]

#### Question 3. Find all of the words in a string that are less than 5 letters

    string = "Practice Problems to Drill List Comprehension in Your Head."

In [91]:
string = "Practice Problems to Drill List Comprehension in Your Head."
for m in string.split():
    if len(m)<5:
        print(m)

to
List
in
Your

#### Question 4: Calculate income tax for the given income by adhering to the below rules

In [137]:
i=float(input('Enter the tax value : '))
if i <= 10000:
        tax = 0
elif i <= 25000:
        tax = (i - 10000) * 0.1
elif i <= 50000:
        tax = (25000 - 10000) * 0.1 + (i - 25000) * 0.2
else:
        tax = (25000 - 10000) * 0.1 + (50000 - 25000) * 0.2 + (i - 50000) * 0.3
print('your income tax ayble is:  $',tax)

Enter the tax value : 60000
your income tax ayble is:  $ 9500.0

##### Question 5. Given below are the list of positive and negative words.
           Also a list of tweets is provided. Separate out the positive and negative comments¶
         
         positive = ['good','awesome', 'best', 'nice']
         
         negative = ['worst','awful', 'bad']
      
      tweets = ['This government policies are good', 'bad implementation', 'The way he played
              showed that he is one of the best players in the world', 'Her acting in the play was awesome',
               'The wine tastes awful', 'It's nice to hear this little kid's laugh']

In [93]:
 import numpy as np

positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']


tweets = ['This government policies are good', 'bad implementation', 
          "The way he played showed that he is one of the best players in the world",
          "Her acting in the play was awesome",
          "The wine tastes awful", "It's nice to hear this little kid's laugh"]
pc=[]
nc=[]
for i in tweets:
    if any( p in i for p in positive):
           pc.append(i)
    elif any(n in i for n in negative):
           nc.append(i)
print('Positive comments = ',pc)
print('Negative Comments = ',nc)

Positive comments =  ['This government policies are good', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', "It's nice to hear this little kid's laugh"]
Negative Comments =  ['bad implementation', 'The wine tastes awful']

#### Exercise 6: Extend nested list by adding the sublist
     You have given a nested list. Write a program to extend it by adding the sublist ["h", "i", "j"] in
     such a way that it will look like the following list.
    
    list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
    
    sub list to add
     sub_list = ["h", "i", "j"]
     
     expected output =['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

In [94]:
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub_list = ["h", "i", "j"]

list1[2][1][2].extend(sub_list)
print(list1)

['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

#### Question 7 :- Remove and add item in a list
      Write a program to remove the item present at index 4 and add it to the 2nd position and at the
     end of the list.
    list1 = [54, 44, 27, 79, 91, 41]

In [95]:
list1 = [54, 44, 27, 79, 91, 41]
a=list1.pop(4)
print(a)
list1.insert(1,a)
list1.append(a)
print(list1)

91
[54, 91, 44, 27, 79, 41, 91]

#### Question 8 :-Load the iris dataset and Find only thoose records
     whoose sepal_length = 5.1 and sepal_width = 3.5

In [139]:
import pandas as pd
import seaborn as sns

sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [ ]:
z=sns.load_dataset('iris')

In [98]:
i =z.loc[(z['sepal_length']==5.1) & (z['sepal_width']==3.5)]
i

    sepal_length  sepal_width  petal_length  petal_width        class
0            5.1          3.5           1.4          0.2  Iris-setosa
17           5.1          3.5           1.4          0.3  Iris-setosa

#### Question 9:- Check for Maximum petal_length and convert it in to 7.2
        and min petal_length and convert it in to 1.2

In [99]:
z.petal_length.max()

maxx= z.replace({'petal_length':{6.9:7.2}})
maxx
maxx.petal_length.max()

7.2

In [100]:
z.petal_length.min()
minn=z.replace({'petal_length':{1.0:1.2}})
minn.petal_length.min()

1.1

####   10. Perform right join to combine values based on the 'ID' in the two dataframes
     Use the dataframe given below, Read the DataFrame with the help of clipboard function.

In [102]:
a1=pd.read_clipboard()
a1

    ID Candidate_Nam e     Subject
0  101            Alex     History
1  102             Amy     English
2  103           Allen  Geograph y
3  104           Alice      German
4  105           James     History
5  106            Sara      German
6  107             Mia     English

In [103]:
a2=pd.read_clipboard()
a2

    ID       City  Subject_Scor e
0  101      Delhi              89
1  102     Mumbai              78
2  103      Delhi              77
3  104    Chennai              87
4  105  Hyderabad              87
5  108      Delhi              84

In [106]:
all_data=pd.merge(a1,a2,on='ID',how='right')
all_data

    ID Candidate_Nam e     Subject       City  Subject_Scor e
0  101            Alex     History      Delhi              89
1  102             Amy     English     Mumbai              78
2  103           Allen  Geograph y      Delhi              77
3  104           Alice      German    Chennai              87
4  105           James     History  Hyderabad              87
5  108             NaN         NaN      Delhi              84